// Lab_03_1.cpp
// < Саламага Андріан >
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 23

#include <iostream>
#include <cmath>
using namespace std;
int main()
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу
	double C; // проміжний результат - функціонально стала частина виразу
	cout << "x = "; cin >> x;
	C = sin(4 * x / 3);
	A = x * x;
	// спосіб 1: розгалуження в скороченій формі
	if (x < (-5))
		B = 1 / tan(x);
	if ((-5) <= x && x <= 0)
		B = 4 - (x * x / 2);
	if (x > 0)
		B = log10(x * x) - (4 * x / 3);
	y = A + B + C;
	cout << endl;
	cout << "1) y = " << y << endl;
	// спосіб 2: розгалуження в повній формі
	if (x < (-5))
		B = 1 / tan(x);
	else
		if (x > 0)
			B = log10(x * x) - (4 * x / 3);
		else
			B = 4 - (x * x / 2);
	y = A + B + C;
	cout << "2) y = " << y << endl;
	cin.get();
	return 0;
}